import os
import re
import shutil
import json

image_path = r"D:\Codes\Image_Edit_Agent\sample\style_examples"

style_list = {
    "sty01": "亮度+ 对比度+ 暗部- 饱和度+",
    "sty02": "对比度+光感- 饱和度-",
    "sty03": "亮度+ 光感+ 高光+ 饱和度+ 色温+",
    "sty04": "高光+ 饱和度- 颗粒+ 褪色+ 色调-",
    "sty05": "暗部+ 色调+ 锐化+ 色温+",
    "sty06": "应用凉夏滤镜（整体偏冷色调，对比度适中）",
    "sty07": "应用去黄柔亮滤镜（降低黄色调，增加亮度和柔和度）",
    "sty08": "应用反差色滤镜（提高明暗对比，增强色彩饱和度）",
    "sty09": "应用旧巷滤镜（增加暖色调，添加颗粒感，降低亮度）",
    "sty10": "应用雨季滤镜（增加冷色调，提高饱和度，增加暗部）",
    "sty11": "色温--，曝光度-，对比度--，白色色阶+",
    "sty12": "色调+，对比度+，白色色阶-，纹理-，清晰度-，鲜艳度++",
    "sty13": "对比度--，白色色阶--，黑色色阶++，去朦胧++，鲜艳度++，饱和度++",
    "sty14": "色温++，曝光度-，高光-，白色色阶+，黑色色阶+，纹理--，清晰度-，去朦胧-",
    "sty15": "中间色调蓝移，高光色调红移，色温+，色调+，曝光度-，白色色阶--，黑色色阶+，纹理+，清晰度+，鲜艳度++",
    "sty16": "应用未来效果滤镜FT04（白色色阶+，黑色色阶-，纹理+，清晰度+，鲜艳度+）",
    "sty17": "应用风景滤镜LN10（白色色阶-，黑色色阶-，纹理+，清晰度+，去朦胧+，鲜艳度+，饱和度+）",
    "sty18": "应用柔和薄雾滤镜（对比度-，高光-，阴影++，白色色阶-，黑色色阶+，清晰度-，去朦胧+）",
    "sty19": "应用即影即有滤镜（对比度-，高光-，阴影++，白色色阶-）",
    "sty20": "应用演唱会CT07滤镜（对比度-，高光-，阴影++，白色色阶-，黑色色阶-，纹理+，清晰度+）",
    "sty21": "应用蓝调增色滤镜（色温降低 ，提升蓝色调饱和度，降低暖色调明度，饱和度整体提升）",
    "sty22": "应用迷幻滤镜（饱和度/鲜艳度大幅提升，对比度显著增加，带轻微模糊）",
    "sty23": "应用海滨滤镜（提亮整体亮度，增强蓝绿色通透感（阴影提亮），饱和度适度提升 ）",
    "sty24": "应用薄荷滤镜（增加绿色/青绿色色调、降低红色部分饱和、高光略提亮）",
    "sty25": "应用日光暖胶滤镜（色温略微增加 (偏暖黄)，加轻微胶片颗粒，降低冷色调明度）",
    "sty26": "唯美晩霞风格，光感-100，亮度-15，曝光+10，对比度+30，饱和度+40，锐化+10，高光+50",
    "sty27": "日常生活复古风格，光感-100，亮度-30，对比度-15，高光-10，饱和度-15，色温+15，色调+10，锐化+50",
    "sty28": "璀璨烟火风格，光感-50，亮度-20，对比度+60，饱和度+30，锐化+50，高光+10",
    "sty29": "高级暗调氛围感，光感-35，亮度-30，对比度+50，饱和度-10，自然饱和度+20，HSL绿色明度-60，HSL蓝色明度-70，暗部-30，高光+60，颗粒+50",
    "sty30": "秋日氛围风格，光感+15，锐度+20，高光+30",
    "sty31": "应用透亮肌滤镜（曝光提升、饱和度略降、亮度和明度略升，阴影柔和）",
    "sty32": "应用追光滤镜（边角叠加暖黄聚光；整体对比度轻微提升；曝光略微增加）",
    "sty33": "应用小森林滤镜（减小饱和、增加冷绿色调；亮度提升一点，阴影柔和；对比度略减）",
    "sty34": "应用粉色一天滤镜（整体加粉色，略降对比度，略增曝光）",
    "sty35": "应用自然滤镜（轻微曝光调节，略降低对比度）",
    "sty36": "应用怀旧AR01滤镜（对比度+，高光-，阴影+，白色色阶+，黑色色阶-，鲜艳度+）",
    "sty37": "应用季节-冬季WN01滤镜（对比度+，阴影+，白色色阶+，黑色色阶-，纹理+，清晰度+，鲜艳度+，饱和度---）",
    "sty38": "应用季节-夏季SM03滤镜（高光-，阴影+，白色色阶+，黑色色阶-，清晰度+，鲜艳度+，饱和度+）",
    "sty39": "应用肖像-群组PG03滤镜（高光-，阴影+，白色色阶+，黑色色阶+，色彩红移）",
    "sty40": "应用视频-创意VCR03滤镜（高光-，阴影+，白色色阶+++，黑色色阶---，饱和度---，四角黑色羽化）"
}

data = []

for image in os.listdir(image_path):
    if not image.endswith(".jpg") and not image.endswith(".png") and not image.endswith(".jpeg"):
        continue
    
    id = image.split('_')[0]
    style = image.split('_')[1].split('.')[0]
    
    if style not in style_list:
        continue
    
    item = {
        "input": f"{id}_{id}.jpg",
        "output": f"{id}_{style}.jpg",
        "request": style_list[style],
        "dataset": "manual"
    }
    
    data.append(item)

with open(os.path.join(image_path, "..", "test_gier_format.json"), 'w', encoding='utf-8') as f:
    json.dump(data, f, indent=4, ensure_ascii=False)
